package day07;
/*
	콘서트 예약 프로그램.
	- 공연은 하루에 한번
	- 좌석은 S석, A석, B석으로 나뉘며, 각각 10개의 좌석이 있다. 
	- 예약 시스템의 메뉴는 "예약", "조회", "취소", "끝내기"가 있다. 
	- 예약은 한번에 한자리만 가능하고, 좌석타입, 예약자이름, 좌석번호를 입력받아 예약한다. 
	- 조회는 모든 좌석을 출력한다. 
	- 취소는 예약자의 이름을 입력받아 취소한다. 
	- 없는 이름, 없는 번호, 없는 메뉴 등에 대해서 오류 메세지를 출력하고 
		사용자가 다시 시도하도록 한다. 
	# 실행예시 #
	자바콘서트홀 예약시스템입니다. 
	예약:1, 조회:2, 취소:3, 끝내기:4 >>   1  (사용자 입력)
	좌석구분 S(1), A(2), B(3) >>  1   (사용자 입력)
	S >> ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
	이름 >>  피카츄  (사용자 입력)
	번호 >>  1  (사용자 입력)
	<<예약 완료>>
	
	예약:1, 조회:2, 취소:3, 끝내기:4 >>   1  
	좌석구분 S(1), A(2), B(3) >>  2   
	A >> ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
	이름 >>  꼬북이  
	번호 >>  5  
	<<예약 완료>>
	
	예약:1, 조회:2, 취소:3, 끝내기:4 >>   2
	S >> 피카츄 ___ ___ ___ ___ ___ ___ ___ ___ ___
	A >> ___ ___ ___ ___ 꼬북이 ___ ___ ___ ___ ___
	B >> ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
	<<조회 완료>>
	
	예약:1, 조회:2, 취소:3, 끝내기:4 >>   3
	좌석구분 S(1), A(2), B(3) >>  2
	A >> ___ ___ ___ ___ 꼬북이 ___ ___ ___ ___ ___
	이름 >>  꼬북이
	<<취소 완료>>
	
	예약:1, 조회:2, 취소:3, 끝내기:4 >>   2
	S >> 피카츄 ___ ___ ___ ___ ___ ___ ___ ___ ___
	A >> ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
	B >> ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
	<<조회 완료>>
	
	예약:1, 조회:2, 취소:3, 끝내기:4 >>   4
	<<프로그램 종료>>
*/

public class Test93 {
	public static void main(String[] args) {
	
		
	}
}
