package day04;

public class Test45 {
	public static void main(String[] args) {

		/*	
			문제1. Up & Down 게임 
				0 ~ 99 사이의 임의의 수(랜던값)를 받아 숨기고, 그 수를 맞추는 게임. 
				임의의 수보다 낮게 입력하면 "Up" 출력, 
				높게 입력하면 "Down" 출력하면서 범위를 좁혀가며 수를 맞춘다. 
				게임을 반복하기 위해 y/n으로 묻고, n인 경우 프로그램 종료 
				
			콘솔예) 
			숫자가 정해졌습니다. 맞춰보세요! 
			0~99
			1 >>	55 (사용자가 입력) 
			"Up"
			55~99
			2 >>	70
			"Up"
			70~99
			3 >>	85
			"Down"
			70~85
			4 >>	80
			"Down"
			70~80
			5 >>	75
			"Up"
			75~80
			6 >>	77
			맞았습니다!! 
			다시하시겠습니까?(y/n) >>	y 
			숫자가 정해졌습니다. 맞춰보세요!
			0~99
			1 >>	30
			"Up"
			30~99
			2 >>	45
			맞았습니다!!
			다시하시겠습니까?(y/n) >> 	n
			게임 종료!	
		*/
		
		
		
		
		
		
		
		
	}
}
