package day12;
/*
	나라와 수도 맞추기 게임을 만들어 보세요. 
	나라 이름(country)과 수도(capital)로 구성된 Nation 클래스를 작성하고,
	ArrayList를 이용하여 아래 실행 예시와 같이 작동되도록 프로그램을 작성하세요.
	실행예시:
		** 수도 맞추기 게임을 시작합니다 **
		입력:1, 퀴즈:2, 종료:3 >> 1 (사용자 입력) 
		현재 8개의 나라와 수도가 입력되어 있습니다. 
		나라와 수도 입력 9>> 한국 서울   (사용자 입력)
		나라와 수도 입력 10>> 그리스 아테네 
		그리스는 이미 있습니다..
		나라와 수도 입력 10>> 호주 시드니
		나라와 수도 입력 11>> 이탈리아 로마
		나라와 수도 입력 12>> 그만 
		입력:1, 퀴즈:2, 종료:3 >> 2 
		호주의 수도는?  시드니  (사용자 입력) 
		정답!! 
		독일의 수도는?  하얼빈
		아닙니다!!
		멕시코의 수도는?  하얼빈 
		아닙니다!!
		이탈리아의 수도는?  로마
		정답!!
		영국의 수도는?  그만 
		입력:1, 퀴즈:2, 종료:3 >> 3
		프로그램을 종료합니다.
*/
public class CollEx10 {
	public static void main(String[] args) {

		/* main 작성 완료, 주석 해제하고 실행 
		CapitalGame game = new CapitalGame(); 
		game.run(); 
		*/
		
	}
}
